In [1]:
import pandas as pd
import sqlite3

In [2]:
conn=sqlite3.connect('mysales.db')

Customers=pd.read_csv('Data/CSV/Customers.csv', encoding='latin-1',sep=";")
Orders=pd.read_csv('Data/CSV/Orders.csv', encoding='latin-1',sep=";")
Products=pd.read_csv('Data/CSV/Products.csv', encoding='latin-1',sep=";")
Location=pd.read_csv('Data/CSV/Location.csv', encoding='latin-1',sep=";")

In [ ]:
# Query write
query='''
SELECT name FROM sqlite_master WHERE type='table'
'''

df=pd.read_sql_query(query,conn)
print(df)

632

In [4]:
query="""SELECT * from customers limit 10;"""
all_customers=pd.read_sql_query(query,conn)
all_customers.describe()

       Customer ID Customer Name
count           10            10
unique          10            10
top       AA-10315    Alex Avila
freq             1             1

In [5]:
query="""select * from orders limit 10"""
all_orders=pd.read_sql_query(query,conn)

In [6]:
Customers.columns.tolist()
Orders.columns.tolist()

['Row ID',
 'Order ID',
 'Order Date',
 'Ship Date',
 'Ship Mode',
 'Customer ID',
 'Segment',
 'Postal Code',
 'Product ID',
 'Sales',
 'Quantity',
 'Discount',
 'Profit']

In [ ]:
query="""
SELECT c.[Customer Name],
sum(o.Quantity*o.Sales)
as Total_Sales
from orders o 
join customers c
on c.[Customer ID]=o.[Customer ID]
group by c.[Customer ID]
order by Total_Sales
desc
limit 10;
"""

df=pd.read_sql_query(query,conn)
df

     Customer Name  Total_Sales
0      Sean Miller       146726
1    Adrian Barton       143812
2     Tamara Chand        92582
3     Becky Martin        88132
4      Joseph Holt        80478
5     Ken Lonsdale        74843
6        Greg Tran        72957
7     Bill Shonely        71566
8    Maria Etezadi        71540
9  Patrick O'Brill        69243